{"Add a bit of color and fragrance":"Grass: It would be marvelous if we could decorate our merchandise shelves with lots of plants. Could we have Grass-type Pokémon come help?",
"Aiming for that punk look":"Poison: We want to use poison to dye our cloths in wonderful colors! Please send us your Poison-type Pokémon!",
"I want my plants to grow":"Rock: I've got some plants that only grow on rocky terrain. I'd like some rough, Rock-type Pokémon to keep my precious plants company.",
"Just keep running":"Dark: We need some Pokémon to try on our shoes. To make sure the shoes can handle rough use, Dark-type Pokémon would be ideal.",
"Let's see what kind of person they are...":"Dark: We would like to hire Dark-type Pokémon. People reveal their true natures when gripped by fear, after all...",
"Let's see what kind of person they are":"Dark: We would like to hire Dark-type Pokémon. People reveal their true natures when gripped by fear, after all...",
"Making cute designs":"Fairy: I'm attempting to create clothing that is cute but also a little mystic. I need the help of Fairy-type Pokémon!",
"Multi-purpose fabric development":"Normal: We're looking for Normal-type Pokémon! Together we can make cloth that you can use in any way you like!",
"Sailing over the water":"Water: This job involves carrying cargo over the water. We're looking for Water-type Pokémon.",
"Show us your motivation":"Fire: We need Pokémon with burning motivation— a fire in their hearts! We need the heat of your passion!",
"Showing off the durability":"Fighting: We want to emphasize how durable our shoes are. We would be very grateful if Fighting-type Pokémon could come help out.",
"So that our crops stay healthy":"Bug: We are welcoming Bug-type Pokémon to help thin out the weeds growing in our farmland!",
"To ensure safe operations":"Electric: We need electricity in order to inspect the monorail! We're waiting for you, Electric-type Pokémon!",
"We want to use the best water":"Water: We want to take particular care in what water we use to brew my coffee. I'd like Pokémon that are knowledgeable about such things.",
"We've started a food delivery service":"Flying: Food is best eaten hot! We'd like to see some Flying-type Pokémon to help fly our meals directly to our customers.",
"Building a solid car":"Ground: Solid, steady Ground-type Pokémon provide the ideal foundation to build cars upon! Let's build cars together!",
"Cruising through the icy waters":"Ice: This job involves carrying cargo over icy seas. We're looking for Ice-type Pokémon.",
"Delicate, high-quality fabric":"Bug: We're looking for Bug-type Pokémon! Let's make the most delicate cloth together!",
"Good cloth requires good string":"Bug: To all Bug-type Pokémon! Please come lend us your strength so that we can create lovely cloth!",
"Help wanted on our farm":"Grass: Nobody can deny that Grass-type Pokémon are the best at handling plants! We would be overjoyed if some could help us out!",
"Surprise delivery":"Ghost: We firmly believe that surprise is the spice of life. We'd like to get Pokémon that can bring people's orders with a little dash of horror.",
"That extra mysterious touch":"Psychic: As a final touch, we like to use psychic powers to make the feel of our cloth truly unique. Would any Psychic-type Pokémon be interested?",
"The basics of cooking":"Fire: In order to ensure the perfect stove temperature when cooking, I want to have Pokémon that are good at burning things come help.",
"To make our food even more delicious":"Dragon: We need Dragon-type Pokémon to help us prepare our food before we cook it. We're not sure why!",
"To properly season our dishes":"Rock: Rock salt, as the name implies, can be found within rocks. We need the help of rock-solid Pokémon to get it!",
"To see that we get some magical people":"Fairy: We'd like to have some purehearted Fairy-type Pokémon to help us judge the true characters of our workers.",
"Assembling ships":"Steel: Ship assembly requires a lot of steel to be cut. We're looking for Steel-type Pokémon to come help us out!",
"Customer acquisition":"Fairy: We'd like to have Pokémon that are cute and charming come over to help attract customers!",
"Developing sports shoes":"Bug: We're making sports shoes! We'd like to have Bug-type Pokémon with lots of legs to help us develop them. Thanks!",
"Fixing up the city's electrical grid":"Ground: We need some help setting up power lines. It'd be great if we could get Pokémon that are immune to electricity.",
"Gotta keep things growing":"Ground: The dirt dictates how well plants do. We ask Ground-type Pokémon to come and help us create fertilizer.",
"Hardcore Pokémon for a wild product":"Dark: We've made some really wild, hardcore shoes. We'd like to get Dark-type Pokémon to wear them, since they'll fit the image perfectly!",
"Help wanted finding books":"Psychic: We would really be grateful if Psychic-type Pokémon could come and use its powers to quickly search for the books we have in stock!",
"Inspection requires strength":"Fighting: We are looking for Fighting-type Pokémon that can use their strength and skill to help with monorail inspection and maintenance!",
"Making cloth with strong string":"Bug: We would like Bug-type Pokémon to assist us in producing durable cloth.",
"Recruiting detail-oriented Pokémon":"Normal: High-quality cloth requires delicate and precise handwork. Are there any Normal-type Pokémon that would like to try?",
"Testing our railcars":"Electric: We would appreciate Electric-type Pokémon that could help power the machinery used in assembly of our railcars.",
"To invent psychic cloth":"Psychic: To all Psychic-type Pokémon! Please come lend us your strength so that we can create some absolutely mind-bending cloth!",
"We need Pokémon that can handle cold":"Ice: We need to get our shipments through blizzards, and the best type of Pokémon to do that is Ice-type Pokémon!",
"We need some nets":"Bug: The only Pokémon capable of creating nets that are both durable and flexible are Bug-type Pokémon! We want you!",
"We're making lenses for glasses":"Rock: We use extremely hard rocks for grinding and polishing our lenses. We would like to recruit Rock-type Pokémon.",
"What it means to roast beans":"Fire: The temperature needs to be just right when roasting coffee beans. Would you be so kind as to send over Fire-type Pokémon?",
"A super-exciting show":"Dragon: We want to make movies that really have a sense of impact—of scale. Could we hire Dragon-type Pokémon to help out?",
"As guidelines for durability":"Steel: We need superbly durable Steel-type Pokémon to help out with car manufacturing. Let's build cars together!",
"Capable customer reception required":"Normal: We would like to have Normal-type Pokémon for customer reception, as they are able to handle many different situations and tasks.",
"Dependable security guard":"Fighting: I work in airport security. We'd like to get Pokémon that are skilled in martial arts to come help us out.",
"Developing powerful shoes":"Fighting: We're making wrestling shoes! We'd like to have powerful Fighting-type Pokémon help us develop them. Thanks!",
"For safe and quick deliveries":"Flying: Swift and graceful deliveries! We'd like to have Flying-type Pokémon like Pelipper come help us out!",
"Good water for our desserts":"Water: In order to create delicious, moist desserts, I would like to ask for Water-type Pokémon to help in measuring out the ingredients.",
"Help wanted making luxurious cloth":"Bug: If one wants to make a truly luxurious cloth, one must use only the best silk. Would any Bug-type Pokémon be interested?",
"Help with cooking":"Fire: Need cooking assistants. Must be good with fire.",
"Horror TV show production":"Ghost: I want to create a horror show the likes of which have never been seen. Please send me Pokémon that are good at being terrifying!",
"Hull inspectors wanted":"Water: We need Water-type Pokémon to dive beneath the ships and inspect the hulls.",
"Into the shrubbery":"Grass: We often have to make deliveries to really grassy areas, so Grass-type Pokémon would be a huge help.",
"Making the perfect cloth":"Normal: We want to create the perfect normal cloth. We need the help of Normal-type Pokémon to do so!",
"Mixing together dangerous chemicals":"Poison: One man's poison is another man's tonic. We would like Poison-type Pokémon to help us prepare prescriptions.",
"Poison against poison, just in case":"Poison: We would like to enlist the help of Poison-type Pokémon, as they are no doubt resistant to toxins.",
"Pokémon resistant to chemicals, please...":"Poison: We are running some experiments involving chemical reactions. We'd like to receive Pokémon that can withstand hazardous chemicals!",
"Pokémon that can deliver in any weather":"Dragon: We would like to hire Dragon-type Pokémon capable of flying through even the roughest weather conditions.",
"Provide the best service at all times":"Normal: We need Normal-type Pokémon, since they're good at handling all sorts of different customers.",
"We want help solving problems":"Psychic: We are looking for Psychic-type Pokémon so that they can sense the thoughts and needs of any customer experiencing troubles.",
"We want to make truly magical cloth":"Fairy: To all Fairy-type Pokémon! Please come lend us your strength so that we can create some magical cloth!",
"Construction work, heavy lifting":"Fighting: Construction needs power! Power means muscles! Please send Pokémon with big muscles!",
"Fixing up the city's lights":"Electric: We need to do some work on power lines, so if we could get Pokémon that are good at manipulating electricity, that'd be great.",
"Flight escort":"Dragon: I would like Dragon-type Pokémon! These sacred creatures of legend are the most fitting to watch over my air travels!",
"Foundation for assembling railcars":"Ground: We are building teams that will assemble our railcars. We're looking for Ground-type Pokémon to help us out.",
"I want more contracts":"Ghost: I feel like I could get more contracts if I was with Pokémon that look like they've actually seen the afterlife!",
"I want our ranch to be a good place":"Grass: Please send Grass-type Pokémon that can keep an eye on the quality of the turf around our ranch!",
"Keeping our veggies fresh":"Water: Vegetables need to be crisp and well hydrated! We'd love to have some Water-type Pokémon come and help us out.",
"Not trying to scare anyone...":"Dark: I'd like to do my rounds with Dark-type Pokémon to give my offers a bit more...gravitas.",
"Recruiting customer support":"Normal: All our customers must be treated equally! We need exemplary Normal-type Pokémon to help us out!",
"Time to do some maintenance":"Steel: There've been some problems reported about the tracks we use. We'd like Steel-type Pokémon to come have a look for us.",
"Time to harvest":"Bug: We're hoping to get some help for harvesting our vegetables. Bug-type Pokémon are always a huge help!",
"To make delightfully chilled desserts":"Ice: In order to make delightfully chilled desserts, I would like to have some Ice-type Pokémon come to help out with temperature management.",
"We need help in the air":"Flying: On and on, over the horizon... We hope that Pokémon that have fallen in love with the sky will come fly with us.",
"We need help sorting our packages":"Steel: We're recruiting for help sorting out electronics that need to delivered. We're looking for Pokémon that are good with metal.",
"We're building a massive ship":"Electric: When building ships, we use electricity to weld large blocks together. We would like Pokémon that could help out with this.",
"You can't cook without it":"Ice: Ice is needed for everything in the food industry, whether it's for dishes or drinks. We need the help of Ice-type Pokémon!",
"A fabric that inspires legends":"Dragon: I want to make a cloth that will inspire legends! I need the help of Dragon-type Pokémon to achieve my goal!",
"A show that will chill you to the bone...":"Ghost: We're doing a show about haunted photos. Could we get Pokémon that would make convincing photos of this sort?",
"A speedy delivery":"Flying: Food needs to be delivered fresh! We need help from Pokémon that are at home in the sky!",
"Creating lightweight shoes":"Electric: We're making running shoes! We'd like to have Electric-type Pokémon that can run at lightning speeds help us out. Thanks!",
"Looking for flowers":"Poison: I want to go to the forest to pick flowers, but it's full of dangers! Could I have some Poison-type Pokémon, since they're good against plants?",
"Making a sound foundation":"Ground: We need to level the ground where we're planning to do construction. We really need Ground-type Pokémon to help us out!",
"Making high-quality clothing":"Bug: Good cloth requires good silk! Please send us Bug-type Pokémon!",
"Muscle talk":"Fighting: I want to inform people about the importance of keeping in shape! Could you send me Pokémon with amazing muscles?",
"Nothing like a little aroma therapy":"Grass: Our employees have to go to dangerous places to work, and so we'd like to surround them with some greenery and nice Pokémon for relaxation.",
"Our specialty dishes":"Fire: We're awful proud of the grill here at our restaurant. We'd be grateful for Pokémon that can keep the flame going while we grill!",
"So you think you're strong":"Fighting: A strong body is the greatest tool on any construction site! We're looking for Fighting-type Pokémon!",
"To provide the best customer care":"Normal: We are looking for Normal-type Pokémon that can flexibly respond to the needs of all our customers.",
"We need models for our clothing":"Fairy: We're trying to make a line of new, adorable clothing pieces. We would like Fairy-type Pokémon to come help us out.",
"We need some quick cleaning":"Fairy: Looking for housekeeping services! We need a Pokémon that can quickly clean up any mess like a little house fairy!",
"We want sparkly clean floors":"Ice: We need help waxing the floors! Accepting any Pokémon that can make the floors here chillingly easy to slip on!",
"Assembling our trains":"Steel: We need Steel-type Pokémon and their skill in using metal and machines to help assemble our railcars.",
"Check with psychic powers":"Psychic: Debugging can be mind-bending sometimes... Are there Pokémon that could maybe use some mysterious powers to find bugs?",
"Cute receptionists, please":"Fairy: We'd like cute, delicate Pokémon to man our front desk. It would do wonders to add some cheer to the place!",
"Delicious delightful ice cream":"Ice: I want to make a deliciously chilled ice cream. Please send Ice-type Pokémon!",
"Flower delivery service":"Grass: I've come up with a brilliant idea... A flower delivery service! So, please send Pokémon that know a lot about plants and flowers!",
"Get those rocks out of the way":"Rock: There are always large rocks kicking around the mining area. We'd like to have Rock-type Pokémon, since they know how to deal with rocks.",
"Need help plowing fields":"Fighting: Any Pokémon that have strong arms are welcome. We need help plowing our fields!",
"Need to wash away all the grime":"Water: The monorail's gotten rather dirty, so we'd like Water-type Pokémon to come help make it nice and clean!",
"Our new line of shoes":"Bug: We are planning to use silk to create a new shoe. We welcome any Bug-type Pokémon.",
"Railcar inspection and maintenance":"Steel: We would like some help from Pokémon that know a lot about metal. You know, Pokémon that are pretty metallic themselves!",
"Safety Checks":"Flying: We need some help doing maintenance, so if we could get Pokémon that are good with high places, that would be great.",
"Spreading spooky knowledge":"Ghost: I want to set up a section on occult books! Do you think you could send me Ghost-type Pokémon to do the advertising?",
"Substation servicing":"Electric: When it comes to inspecting transformer stations, nothing does a better job than Electric-type Pokémon!",
"The delicious secret of our hotel":"Fire: The secret to cooking is fire! We welcome any Fire-type Pokémon, as they're great at working with flames.",
"Through water and fire":"Dragon: Pokémon that can push through areas that are on fire or dripping water, please come help us!",
"To keep our guests toasty warm":"Fire: We are looking for Fire-type Pokémon so that customers who are sensitive to the cold can have rooms that are toasty warm.",
"We need Pokémon to try on our clothes":"Dark: We want to develop durable cloth that can stand up to even the harshest treatment. We request Dark-type Pokémon to help out with this!",
"We need some music around here":"Electric: We need help wiring up audio equipment and the like. Pokémon that have a knack for that sort of thing are more than welcome.",
"We need some solid help for shipping":"Ground: We'd really appreciate getting solid Pokémon that are really well-grounded to help us lug some big luggage.",
"Appearances matter for security guards":"Dark: There's a dangerous area we need to keep folks out of. I need fierce-looking Pokémon. No need for them to do anything. I just need them around.",
"Cooking temperature is all important":"Fire: Our cook needs assistants! Please send Fire-type Pokémon that are good at maintaining perfect cooking temperatures!",
"Electricity is so useful":"Electric: We use electricity to remove impurities from copper, so we would like to hire Electric-type Pokémon!",
"Emergency refill needed":"Water: There's one thing that we absolutely need to put out fires, and we're looking for a Pokémon that can help us refill our fire truck!",
"Experimenting with medicinal herbs":"Grass: Medicinal herbs are best handled by Pokémon that are familiar with various leaves and roots.",
"Falling rocks hurt quite a bit":"Rock: Falling rocks can be a real hazard where we work. Pokémon that know a lot about rocks, please help!",
"Good water makes good food":"Water: Clean water is the basis for delicious meals! We'd like to hire Pokémon that have an eye for water quality.",
"Looking to promote insurance policies":"Poison: The sole purpose of this job is to demonstrate the dangers of poison—nothing more. Show us your best moves!",
"Making a fabric that can't be cut":"Bug: We want to develop cloth that can't be cut, and for that, we need the help of Bug-type Pokémon! Please send them our way!",
"Making sweets is all about the image":"Fairy: I really want to emphasize how light and fluffy our products are. Please send Fairy-type Pokémon!",
"Need help watering wide areas":"Flying: We are looking to water our plants from the sky. Flying-type Pokémon, please feel free to apply!",
"Need some help with digging":"Ground: We need Pokémon that know a lot about the ground, since we're trying to mine the ore here in the Galar region. Please send Ground types!",
"Nothing too serious":"Dark: We've had some problems with people falling asleep on the job. We'd like to have intimidating Pokémon around to keep an eye on things.",
"Pokémon immune to poison, please":"Steel: We sometimes need to make use of potentially poisonous chemicals. We would like Steel-type Pokémon since they are immune to poison.",
"Researching mysterious powers":"Psychic: Please let us research the mysterious psychic powers that certain Pokémon can use.",
"Solving unsolved mysteries":"Ghost: In order to help us solve many inexplicable mysteries, please send us Pokémon that are really haunting.",
"We need taste testers, please":"Normal: I would like Normal-type Pokémon to show off how delicious my sweets are by eating them in a delicious way.",
"We'll deliver to any location":"Dragon: We're looking for rugged Pokémon that can handle rain, lightning, and even raging fires!",
"A good show about cleaning":"Poison: We're doing a special on sewer systems! Could we get Poison-type Pokémon? They can handle the smell.",
"A type that can handle danger, please":"Dark: Transporting money can be dangerous. We'd like to hire Pokémon that have a dark aura about them, to scare away any bad guys.",
"Cold delivery":"Ice: In order to transport frozen foods in the perfect environment, we need some chilly Pokémon.",
"Construction survey":"Ground: I'd like to do a proper survey of the land condition before we begin construction. Are there Pokémon that could help me out?",
"Cooking competition show":"Fire: I'm looking to create a red-hot cooking competition show—one that's on FIRE! Do you have any ideas for Pokémon that'd help?",
"Cute, fantastical Pokémon wanted":"Fairy: We need help cleaning up guest rooms. We would like Pokémon that are cute and pure to come help us out.",
"Even in the vacuum of space":"Poison: We're hoping to create fabric that can be used in space! Please send Flying-type Pokémon!",
"Handling complaints":"Ghost: Complaint management means dealing with the grudges and curses of the customers. Is there a type of Pokémon that loves these?",
"Help wanted carrying books":"Fighting: We would like to have really strong Pokémon come help us, since we need to carry heavy books like dictionaries and whatnot.",
"Keep an eye on our network":"Electric: It's a simple job of just keeping an eye on our various networks. Please send us Pokémon that are good with different signals and wavelengths.",
"Normal help is the best help":"Normal: I want to create dishes that'll be accepted by everyone. I'd like to get input from common, plain, normal Pokémon.",
"Our flowers need help":"Water: All plants need water! And as it so happens, Water-type Pokémon are the best at watering plants!",
"Our truck needs a wash":"Water: Our delivery truck's gotten a bit dirty, so we want to wash it off and make it shine again! We're waiting for Pokémon that can help!",
"Pokémon strong against physical attacks":"Rock: They might get zapped a bit by electricity, but we would really like to get some powerful Pokémon that are good with rocky terrain!",
"Preparing for anything":"Dragon: In order to ensure we are prepared for any kind of case, we are searching for Pokémon resistant to the Fire, Water, Grass, and Electric types.",
"Preparing for nature":"Poison: In order to prepare for cases in natural areas, we are searching for Pokémon resistant to the Grass, Bug, and Fairy types.",
"Preparing for strange things":"Steel: In order to prepare for particularly strange cases, we are searching for Pokémon resistant to the Psychic, Flying, and Fairy types.",
"Recording the cries of bugs":"Bug: Recordings of the superb cries of Bug-type Pokémon are all the rage now, and we'd like to record yours, too!",
"Removing impurities":"Fire: We need to remove impurities from various metals. We need Pokémon who can handle flame, so please send Fire-type Pokémon!",
"To meet our customers' needs":"Psychic: System engineers need to be able to tell exactly what customers want. Send us Pokémon that can read minds somehow.",
"To protect our investments":"Dragon: We'd like to see Pokémon that look strong enough to deter even the most determined criminals. Please send us Dragon types!",
"Top-secret project":"Ghost: wE ARe searChing for somE HelP. THE wOrk MUst be kepT coMPletEly secreT. We wiLl PAY You HANdsomly."}